Revit 2027 API
BuiltInFailures.EditingFailures.ReloadBeforeMakeEditable Property
 You must Reload Latest before editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ReloadBeforeMakeEditable { get; }
Public Shared ReadOnly Property ReloadBeforeMakeEditable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ReloadBeforeMakeEditable {
	FailureDefinitionId^ get ();
}
static member ReloadBeforeMakeEditable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace